# What and Why we are using Pandas?

### What is it?
- Pandas is Python library used for data manipulation and analysis

### Why we are using it?
- In think because its is very powerful :)))
- Here is what it can do:
    - import data from various formats (json, sql, xlxs,..)
    - manipulating data (cleaning, transforming, visualizing,...)
    - And much more...
    
<hr>

In [1]:
# First lets import pandas
import numpy as np
import pandas as pd

## Series
- A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

**Sound it like Numpy array?**
- One diferent things is that in Pandas Series we have axis labels, meaning that we can access data by indexed a label instead of a number location.

In [2]:
# you can convert a list, numpy array, dictionary to a Series
axis_label = ['a','b','c']
list1 = [100,200,300]
arr1 = np.array(list1)
diction1 = {
    'a':100,
    'b':200,
    'c':300
}

**List**

In [3]:
pd.Series(data=list1)

0    100
1    200
2    300
dtype: int64

In [4]:
pd.Series(data=list1, index=axis_label)

a    100
b    200
c    300
dtype: int64

**Numpy array**

In [5]:
pd.Series(arr1)

0    100
1    200
2    300
dtype: int32

In [6]:
pd.Series(arr1,axis_label)

a    100
b    200
c    300
dtype: int32

**Dictionary**

In [7]:
pd.Series(diction1)

a    100
b    200
c    300
dtype: int64

**Even function**

In [8]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [9]:
# you can take sum of 2 Series

ser1 = pd.Series(data=[1,2,3],index=['A','B','D'])
ser2 = pd.Series(data=[10,20,30],index=['A','B','C'])

ser1 + ser2 # it will take the sum of 2 index(axis_label) have the same name

A    11.0
B    22.0
C     NaN
D     NaN
dtype: float64

<hr>

## DataFrames
- That is just a bunch of Series that share the same index(axis_label)

In [10]:
df1 = pd.DataFrame(data = np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df1

          W         X         Y         Z
A  0.687724  1.115088 -1.884413 -0.859023
B -0.099371 -1.157715  0.822326  0.618447
C -1.573068  0.528304 -0.241682  2.068446
D -1.063389  0.164299 -0.905752  0.343066
E  0.151257 -0.379639 -0.431457 -0.157105

**Indexing and Selecting**

In [11]:
# Select column
df1['W']

A    0.687724
B   -0.099371
C   -1.573068
D   -1.063389
E    0.151257
Name: W, dtype: float64

In [12]:
# Multiple columns
df1[['W','Z']]

          W         Z
A  0.687724 -0.859023
B -0.099371  0.618447
C -1.573068  2.068446
D -1.063389  0.343066
E  0.151257 -0.157105

In [13]:
# Select row
df1.loc['A'] # using label

W    0.687724
X    1.115088
Y   -1.884413
Z   -0.859023
Name: A, dtype: float64

In [14]:
# Select row
df1.iloc[0] # using index

W    0.687724
X    1.115088
Y   -1.884413
Z   -0.859023
Name: A, dtype: float64

In [15]:
# Select multiple row
df1.loc[['A','D']]

          W         X         Y         Z
A  0.687724  1.115088 -1.884413 -0.859023
D -1.063389  0.164299 -0.905752  0.343066

In [16]:
# Create new row
df1.loc['newRow'] = df1.loc['A'] + df1.loc['D']
df1

               W         X         Y         Z
A       0.687724  1.115088 -1.884413 -0.859023
B      -0.099371 -1.157715  0.822326  0.618447
C      -1.573068  0.528304 -0.241682  2.068446
D      -1.063389  0.164299 -0.905752  0.343066
E       0.151257 -0.379639 -0.431457 -0.157105
newRow -0.375665  1.279387 -2.790165 -0.515957

In [17]:
# create new column
df1['newColumn'] = df1['W'] + df1['Z']
df1

               W         X         Y         Z  newColumn
A       0.687724  1.115088 -1.884413 -0.859023  -0.171299
B      -0.099371 -1.157715  0.822326  0.618447   0.519076
C      -1.573068  0.528304 -0.241682  2.068446   0.495378
D      -1.063389  0.164299 -0.905752  0.343066  -0.720323
E       0.151257 -0.379639 -0.431457 -0.157105  -0.005848
newRow -0.375665  1.279387 -2.790165 -0.515957  -0.891622

In [18]:
# Select both row and column
df1.loc[['A','B'],['W','Z']]

          W         Z
A  0.687724 -0.859023
B -0.099371  0.618447

In [19]:
# remove column of df1
df1.drop('newColumn', axis=1) # axis=1 for column =0 for row

               W         X         Y         Z
A       0.687724  1.115088 -1.884413 -0.859023
B      -0.099371 -1.157715  0.822326  0.618447
C      -1.573068  0.528304 -0.241682  2.068446
D      -1.063389  0.164299 -0.905752  0.343066
E       0.151257 -0.379639 -0.431457 -0.157105
newRow -0.375665  1.279387 -2.790165 -0.515957

In [20]:
# but when you see df1 it does not remove in it
df1

               W         X         Y         Z  newColumn
A       0.687724  1.115088 -1.884413 -0.859023  -0.171299
B      -0.099371 -1.157715  0.822326  0.618447   0.519076
C      -1.573068  0.528304 -0.241682  2.068446   0.495378
D      -1.063389  0.164299 -0.905752  0.343066  -0.720323
E       0.151257 -0.379639 -0.431457 -0.157105  -0.005848
newRow -0.375665  1.279387 -2.790165 -0.515957  -0.891622

In [21]:
# Specific inplace parameter if you want to replace in the original
df1.drop('newColumn',axis=1,inplace=True)

In [22]:
df1 # it has been removed

               W         X         Y         Z
A       0.687724  1.115088 -1.884413 -0.859023
B      -0.099371 -1.157715  0.822326  0.618447
C      -1.573068  0.528304 -0.241682  2.068446
D      -1.063389  0.164299 -0.905752  0.343066
E       0.151257 -0.379639 -0.431457 -0.157105
newRow -0.375665  1.279387 -2.790165 -0.515957

In [23]:
# drop row
df1.drop('E') # in the default axis=0

               W         X         Y         Z
A       0.687724  1.115088 -1.884413 -0.859023
B      -0.099371 -1.157715  0.822326  0.618447
C      -1.573068  0.528304 -0.241682  2.068446
D      -1.063389  0.164299 -0.905752  0.343066
newRow -0.375665  1.279387 -2.790165 -0.515957

**conditional selecting**

In [24]:
df1

               W         X         Y         Z
A       0.687724  1.115088 -1.884413 -0.859023
B      -0.099371 -1.157715  0.822326  0.618447
C      -1.573068  0.528304 -0.241682  2.068446
D      -1.063389  0.164299 -0.905752  0.343066
E       0.151257 -0.379639 -0.431457 -0.157105
newRow -0.375665  1.279387 -2.790165 -0.515957

In [25]:
df1 > 0

            W      X      Y      Z
A        True   True  False  False
B       False  False   True   True
C       False   True  False   True
D       False   True  False   True
E        True  False  False  False
newRow  False   True  False  False

In [26]:
df1[df1>0]

               W         X         Y         Z
A       0.687724  1.115088       NaN       NaN
B            NaN       NaN  0.822326  0.618447
C            NaN  0.528304       NaN  2.068446
D            NaN  0.164299       NaN  0.343066
E       0.151257       NaN       NaN       NaN
newRow       NaN  1.279387       NaN       NaN

In [27]:
df1[df1['W']>0]

          W         X         Y         Z
A  0.687724  1.115088 -1.884413 -0.859023
E  0.151257 -0.379639 -0.431457 -0.157105

In [28]:
df1[df1['W']>0][['Y','X']]

          Y         X
A -1.884413  1.115088
E -0.431457 -0.379639

**reset and set index**

In [29]:
df1

               W         X         Y         Z
A       0.687724  1.115088 -1.884413 -0.859023
B      -0.099371 -1.157715  0.822326  0.618447
C      -1.573068  0.528304 -0.241682  2.068446
D      -1.063389  0.164299 -0.905752  0.343066
E       0.151257 -0.379639 -0.431457 -0.157105
newRow -0.375665  1.279387 -2.790165 -0.515957

In [30]:
df1.reset_index(inplace=True)
df1

    index         W         X         Y         Z
0       A  0.687724  1.115088 -1.884413 -0.859023
1       B -0.099371 -1.157715  0.822326  0.618447
2       C -1.573068  0.528304 -0.241682  2.068446
3       D -1.063389  0.164299 -0.905752  0.343066
4       E  0.151257 -0.379639 -0.431457 -0.157105
5  newRow -0.375665  1.279387 -2.790165 -0.515957

In [31]:
df1['New index'] = 'Minh Long Yen Oanh Trinh Dontknow'.split()
df1

    index         W         X         Y         Z New index
0       A  0.687724  1.115088 -1.884413 -0.859023      Minh
1       B -0.099371 -1.157715  0.822326  0.618447      Long
2       C -1.573068  0.528304 -0.241682  2.068446       Yen
3       D -1.063389  0.164299 -0.905752  0.343066      Oanh
4       E  0.151257 -0.379639 -0.431457 -0.157105     Trinh
5  newRow -0.375665  1.279387 -2.790165 -0.515957  Dontknow

In [32]:
df1

    index         W         X         Y         Z New index
0       A  0.687724  1.115088 -1.884413 -0.859023      Minh
1       B -0.099371 -1.157715  0.822326  0.618447      Long
2       C -1.573068  0.528304 -0.241682  2.068446       Yen
3       D -1.063389  0.164299 -0.905752  0.343066      Oanh
4       E  0.151257 -0.379639 -0.431457 -0.157105     Trinh
5  newRow -0.375665  1.279387 -2.790165 -0.515957  Dontknow

In [33]:
df1.set_index('New index',inplace=True)
df1

            index         W         X         Y         Z
New index
Minh            A  0.687724  1.115088 -1.884413 -0.859023
Long            B -0.099371 -1.157715  0.822326  0.618447
Yen             C -1.573068  0.528304 -0.241682  2.068446
Oanh            D -1.063389  0.164299 -0.905752  0.343066
Trinh           E  0.151257 -0.379639 -0.431457 -0.157105
Dontknow   newRow -0.375665  1.279387 -2.790165 -0.515957

<hr>

## Missing Data
- In real like we usually deal with some unusual data Pandas provide some method to solve it

In [34]:
df2 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [35]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
df2.dropna()

     A    B  C
0  1.0  5.0  1

In [37]:
df2.dropna(axis=1) # default is 0

   C
0  1
1  2
2  3

In [38]:
df2.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [39]:
df2.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [40]:
df2['A'].fillna(value=df2['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Operation on DataFrames

In [41]:
df3 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
df3['col2'].unique()

array([444, 555, 666], dtype=int64)

In [43]:
df3['col2'].nunique()

3

In [44]:
df3['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64